
let math = require("mathjs")
let table = [
	{q: `Колко е средна гъстота на София?`, a: `918,7 човека на кв. Км ???`},
	{q: `Кои са новите ГКПП в Югоизточния регион?/ Южен Централен регион`, a: `Югоцентрален регион - Златоград и Ивайловград`},
	{q: `Какъв е климата в Югозападния регион?`, a: `
	умерено-континентален(3 части) във меридиялна посока:
		Северна част(Умерено континентален)
		Средна част(Преходен)
		Южна част(Континелнтално-средиземносморски)`},
	{q: `Какъв е климата в Южен-централен регион?`, a: `топла зима и лято, високи сумарни температури, благоприятни условия за топлолюбиви култури`},
	{q: `Какъв е климата в Югоизточния регион?`, a: `???`},
	{q: `Кои са основните почвени типове в Югозападния регион?`, a: `Около струма и Места алувиялано ливадни там се отглеждат картофи и зеленчуци
`},
	{q: `Кои трянспортни коридори преминават през Южен централен регион?`, a: `10`},
	{q: `Какъв е приблизтелният общ брой на населението в Югозападния регион?`, a: `2,133млн`},
	{q: `***Кой ВЕЦ се намира на язовир Искър?***`, a: `В плана за югозападния регион пише: Изкуствени: ВЕЦ язовир Искър, ВЕЦ Кокаляне, ВЕЦ Пасарел`},
	{q: `Кои ГКПП в Югозападния регион?`, a: `Калотина, Гюешево, Кулата`},
	{q: `Кои ГКПП в Южен централен регион?`, a: `Златоград, Ивайловград, Капитан Андреево`},
	{q: `Географско положение, граници и големина на Югозападния регион?`, a: ``},
	{q: `Географско положение, граници и големина на Югоизточния регион?`, a: `

А) географско положение
	- благоприятно причерноморско геогр. Положение. Широк плаж на Черно море, което влияе
	върху стопанското му специализиране. Регионът е широко отворен на запад , към Южна
	България.
Б) граници
	- южна граница – с Турция – ГКПП-та (Малко Търново, Лесово)
	- източна граница – с Черно море
	- северна граница – следва билото на Средна и Източна Стара планина
	- западна граница – граничи с източната граница на Южен централен регион

		`},
	{q: `Географско положение, граници и големина на Южен-централен регион?`, a: `
А) северна граница – продължава по билото на Средна Стара планина, където се намира Троянския проход (Беклемето)
Б) западна граница – съвпада с източната границата на югозападния регион
В) южната граница на региона е с административни функции и съвпада с държавната ни граница с Турция и Гърция
- при Капитан Андреево се отделя жп линия за Александрополис
- най-нови ГКПП са Златоград и Ивайловград


		`},
	{q: `Къде има мебелна промишленост в Югозападния регион?`, a: `софия, благоев град, разлог`},
	{q: `Колко процента е националната промишленост в Югозападния регион от продикцията на станата?( става въпрос за вторичен сектор)`, a: `36.4%`},
	{q: `Къде се произвежда подемно-транспортна техника?`, a: `Пловдив`},
	{q: `Фактори за развитие на селище?`, a: `Еми това го няма в плановете. Предполагам климат, местоположение, полезни изкопаеми,природни ресурси, такива работи`},
	{q: `В кой район земята е заета предимно от зърнени култури?(8,8% от обработваемата земя в страната)`, a: `Южно-централен регион`},
	{q: `Кой регион има най-висок дял в промишлената продукция?`, a: `???`},
	{q: `Кой е специфичния отрасъл на вторичния сектов в Югозапасния регион?`, a: `Металургия`},
	{q: `Кой регион има най-много инвестиции?`, a: `Югозападния`},
	{q: ` Кои са трите основни ЖП линии в Родопите?`, a: `
1. Хасково – Подкова
2. Кричим – Пещера
3. Септември – Добринище ( теснолинейка )
	`},
	{q: `През кой ГКПП се отделя ЖП линия за Александрополис?`, a: `Капитан Андреево`}
	//{q: `question`, a: `answoer`},
]


function get(){
	let index = math.randomInt(table.length)
	return table[index]

} 


let element = get()
console.log(element.q)


process.on('SIGINT', function() {
	// console.log("Caught interrupt signal");
	
	console.log("\n" + element.a)

	process.exit();
});

let s = 0
function call(){
	process.stdout.write(`${s}` + "\033[0G");
	// console.log(s)
	s+=1
	setTimeout(call, 1000)

}

call()
// setTimeout(t => {
	// console.log(element.a)
// }, 10000)
